{"global_desc": ["Steve", "Denton", "Inactive", "  USA", "DOB", "(1956.09.05)", "Turned Pro", "Weight 180Lbs(82kg)", "Height 6'2\"(188cm)", "Birthplace Kingsville, TX", "Residence Austin, TX, USA", "Plays Right-Handed", "Coach Warren Jacques"], "bio": ["Player Bio", "Personal", "Steve Denton took up tennis for medical reasons, and the game has certainly been good for his health. As a youngster in Driscoll, Texas (population 650), Steve had to forego football because of allergies. His doctors urged him to play tennis, a sport which was not exactly popular in his part of the country. Steve's mother had to drive him to Corpus Christi (a 100-mile round-trip) for him to have the opportunity to play against good competition under quality conditions. At the University of Texas, where he and Kevin Curren were roomates, his doubles results overshadowed his singles, a situation that would continue into his initial days on the pro tour. In fact, it was his doubles prowess with Curren that hurt his singles progress; he and Kevin would often be in the late rounds of tournaments in doubles, that prevented them from going on and qualifying in the next singles event.", "A good-humored easy going man, (he won the ATP Sportsmanship award in 1982), he worked himself on the court and dieted off it to make himself a more agile tennis player. The program, instituted by coach Warren Jacques, boosted Steve as high as No. 10 on the ATP computer. When Steve first came on the circuit, he was nicknamed \"The Bull\". Member of 1980 U.S. Junior Davis Cup team.There was some doubt as to whether the name stemmed from the longhorn emblazoned on his college ring, or the content of his many tales. Like his friend and doubles partner Curren, Steve took such a shine to Austin that he has never left. His father, Claude, every bit as likeable as his son, runs an oil drilling supply firm in Driscoll. Named tennis coach at Texas A&M in 2007.", "Best Grand Slam Results:", "Doubles champion at 1982 U.S. Open (w/Curren); Runner-up at 1981 and 1982 Australian Open; Reached Round of 16 at 1982 Wimbledon, 1982 U.S. Open.", "Qualified for 1983 Masters, 1981, 1982 and 1983 Masters doubles (w/Curren). Runner-up at 1982 Masters doubles."], "specific_stats": {"0": {"all": ["No Player Stats", "We do not have any stats for this player."]}}}